# Practique transformation de donnes - Imputation
Ricardo Vallejo

In [55]:
import pandas as pd
import numpy as np
import seaborn as sns
from sklearn.impute import SimpleImputer

### 1) Obtenir les donnes

In [7]:
df = pd.read_excel('Libro1.xlsx')
df

   poids   taille
0    70.0   175.0
1    80.0   180.0
2    92.0     NaN
3     NaN     NaN
4    65.0     NaN
5    77.0   158.0
6     NaN   195.0

### 2) Supprimer les lignes ou NAN sur poids

In [13]:
df1 = df.dropna(subset = ['poids '])
df1

   poids   taille
0    70.0   175.0
1    80.0   180.0
2    92.0     NaN
4    65.0     NaN
5    77.0   158.0

In [ ]:
### 2) Supprimer le column pods

In [16]:
df2 = df.drop(columns = ['poids '])
df2

   taille
0   175.0
1   180.0
2     NaN
3     NaN
4     NaN
5   158.0
6   195.0

### 3) Remplacer pour la mediane

In [20]:
mediane_poids = df["poids "].median()
mediane_taille = df["taille"].median()
df["poids "].fillna(mediane_poids, inplace=True)
df["taille"].fillna(mediane_taille, inplace=True)
df

   poids   taille
0    70.0   175.0
1    80.0   180.0
2    92.0   177.5
3    77.0   177.5
4    65.0   177.5
5    77.0   158.0
6    77.0   195.0

### Using SimpleImputer

In [57]:

imputer = SimpleImputer(strategy="median")
imputer.fit(df)

SimpleImputer(strategy='median')

In [60]:
df['poids '] = imputer.transform(df)[:,0]
df

   poids   taille
0    70.0   175.0
1    80.0   180.0
2    92.0   177.5
3    77.0   177.5
4    65.0   177.5
5    77.0   158.0
6    77.0   195.0

In [ ]:
### All columns same time

In [65]:
X = imputer.transform(df)
dfX = pd.DataFrame(X, columns=df.columns)
dfX

   poids   taille
0    70.0   175.0
1    80.0   180.0
2    92.0   177.5
3    77.0   177.5
4    65.0   177.5
5    77.0   158.0
6    77.0   195.0

# PART 2:

In [24]:
dfB = pd.read_excel('Libro1.xlsx', sheet_name='Hoja2')
dfB

   values
0       1
1       3
2       4
3       5
4      28
5      12
6      14
7      56

### 1) Show values plus grand que 3

In [25]:
dfB2 = dfB[dfB["values"] > 3]
dfB2

   values
2       4
3       5
4      28
5      12
6      14
7      56

# PART 3

Procéder au filtrage pour ne garder que les lignes dont les cellules (une ou plusieurs cellule) ont des valeurs > 3.

In [52]:
dfC = pd.read_excel('Libro1.xlsx', sheet_name='Hoja3')
dfC

   Val1  Val2
0     1     5
1     3     6
2     4     7
3     5     8
4    28    19
5    12     8
6     2     1
7    14     7
8    56     2

In [30]:
dfc1 = dfC[dfC["Val1"] > 3]
dfc1

   Val1  Val2
2     4     7
3     5     8
4    28    19
5    12     8
7    14     7
8    56     2

In [50]:
dfc2 = dfC[(dfC['Val1'] > 3) & (dfC['Val2'] > 3)]
dfc2

   Val1  Val2
2     4     7
3     5     8
4    28    19
5    12     8
7    14     7

In [51]:
dfC.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Val1    9 non-null      int64
 1   Val2    9 non-null      int64
dtypes: int64(2)
memory usage: 272.0 bytes

# PART 4

In [73]:
dfD = pd.read_excel('Libro1.xlsx', sheet_name='Hoja4')
dfD

  Date_achat     qte
0 2019-02-14  175.00
1 2018-07-13  180.00
2 2019-12-11    1.95

In [76]:
dfD['Date_achat'] = pd.to_datetime(dfD['Date_achat'])
dfD

  Date_achat     qte
0 2019-02-14  175.00
1 2018-07-13  180.00
2 2019-12-11    1.95

In [89]:
dfD['year'] = dfD['Date_achat'].dt.year
dfD['month'] = dfD['Date_achat'].dt.month
dfD['day'] = dfD['Date_achat'].dt.day
dfD

  Date_achat     qte  year  month  day
0 2019-02-14  175.00  2019      2   14
1 2018-07-13  180.00  2018      7   13
2 2019-12-11    1.95  2019     12   11

In [84]:
dfD.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Date_achat  3 non-null      datetime64[ns]
 1   qte         3 non-null      float64
 2   year        3 non-null      int64
 3   month       3 non-null      int64
 4   day         3 non-null      int64
dtypes: datetime64[ns](1), float64(1), int64(3)
memory usage: 248.0 bytes

# PART 5

In [87]:
df5 = pd.read_excel('Libro1.xlsx', sheet_name='Hoja5')
df5

        Participant     Ville
0    Alain flouflou  MONTREAL
1   Abdel Flouclair    Ottawa
2  Annie ClairClair    ottawa
3    Smith Sinclair  New York

Développer une stratégie avec un map pour obtenir la série pays (obtenue à partir de la série ville). Les pays sont : Canada et USA.

In [94]:
cities = pd.read_excel('Libro1.xlsx', sheet_name='cities')
city_to_search = "MONTREAL"
getCountry = cities[cities['City'] == city_to_search].Country
getCountry

0    CAN
Name: Country, dtype: object

In [104]:
cities

       City Country  population
0  MONTREAL     CAN          12
1     Otawa     CAN          31
2  New York     USA          33

In [107]:
def defineCountry(cities, city_to_search):
    dftemp = cities[cities['City'] == city_to_search]
    return dftemp.Country

df7 = map(defineCountry(cities, df5['Ville']), df5)
df7

ValueError: Can only compare identically-labeled Series objects

In [98]:
df7

In [102]:
defineCountry(cities, "MONTREAL")

0    CAN
Name: Country, dtype: object

In [99]:
df7.value

AttributeError: 'map' object has no attribute 'value'